app/views/movies/index.html.erb

SELECT "shows".* FROM "shows" WHERE "shows"."movie_id" = ? AND ("shows"."datetime" BETWEEN '2016-05-15 00:00:00.000000' AND '2016-05-15 23:59:59.000000')  ORDER BY "shows"."datetime" ASC  [["movie_id", 4]]
SELECT COUNT(*) FROM "shows" WHERE "shows"."movie_id" = ? AND ("shows"."datetime" BETWEEN '2016-05-15 00:00:00.000000' AND '2016-05-15 23:59:59.000000')  [["movie_id", 4]]
---
		<% @movies.each do |movie| %>
			<% unless (current_user && current_user.admin) || !movie.shows.where(datetime: (DateTime.now.beginning_of_day()..(DateTime.now + (6 * 24).hours).end_of_day())).empty? %>