app/views/movies/show.html.erb

SELECT  1 AS one FROM "actors" WHERE "actors"."movie_id" = ? LIMIT 1  [["movie_id", 1]]
SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" = ?  [["movie_id", 1]]
---
			<div class="actors">
				<% unless @movie.actors.empty? %>

SELECT "shows".* FROM "shows" WHERE "shows"."movie_id" = ? AND ("shows"."datetime" BETWEEN '2016-05-13 00:00:00.000000' AND '2016-05-13 23:59:59.000000')  ORDER BY "shows"."datetime" ASC  [["movie_id", 1]]
SELECT COUNT(*) FROM "shows" WHERE "shows"."movie_id" = ? AND ("shows"."datetime" BETWEEN '2016-05-13 00:00:00.000000' AND '2016-05-13 23:59:59.000000')  [["movie_id", 1]]
---
				<div class="day">
					<% unless @movie.shows.where(datetime: (DateTime.now + (i * 24).hours).beginning_of_day()..(DateTime.now + (i * 24).hours).end_of_day()).empty? %>