app/views/reservations/index.html.erb

SELECT "reservations".* FROM "reservations" WHERE ("reservation"."show.datetime" BETWEEN '2016-05-13 12:12:07.451225' AND '2017-05-13 12:12:07.451242')
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 2]]
---
				<%= link_to "Spettacoli", shows_path, class: "nav_item" %>
			<% elsif current_user.reservations.count > 0 %>

SELECT "seats".* FROM "seats" INNER JOIN "reservations_seats" ON "seats"."id" = "reservations_seats"."seat_id" WHERE "reservations_seats"."reservation_id" = ?  [["reservation_id", 5]]
SELECT COUNT(*) FROM "seats" INNER JOIN "reservations_seats" ON "seats"."id" = "reservations_seats"."seat_id" WHERE "reservations_seats"."reservation_id" = ?  [["reservation_id", 5]]
---
			<div class="info">
				<% if reservation.seats.count == 1 %>