app/views/reservations/show.html.erb

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 2]]
---
				<%= link_to "Spettacoli", shows_path, class: "nav_item" %>
			<% elsif current_user.reservations.count > 0 %>

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 1]]
SELECT "seats".* FROM "seats" INNER JOIN "reservations_seats" ON "seats"."id" = "reservations_seats"."seat_id" WHERE "reservations_seats"."reservation_id" = ?  [["reservation_id", 2]]
---
		<% row = "" %>
		<% @reservation.show.theater.seats.each do |seat| %>

SELECT COUNT(*) FROM "seats" INNER JOIN "reservations_seats" ON "seats"."id" = "reservations_seats"."seat_id" WHERE "reservations_seats"."reservation_id" = ?  [["reservation_id", 2]]
---
		<div class="legend">
			<div class="sample"><div class="seat reserved">X</div><% if @reservation.seats.count == 1 %>il tuo posto<% else %>i tuoi posti<% end %></div>