app/controllers/movies_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."movie_id" = ? AND ("shows"."datetime" BETWEEN '2016-05-13 00:00:00.000000' AND '2016-05-13 23:59:59.000000')  ORDER BY "shows"."datetime" ASC  [["movie_id", 1]]
---
  def index
    time_range = DateTime.now.beginning_of_day()..DateTime.now.end_of_day() + 365.day
  	@movies = Movie.includes(:shows).order('shows.datetime ASC')#.where("shows.datetime > ?  OR shows = ?", DateTime.now, nil)

INSERT INTO "movies" ("title", "plot", "director", "genere", "trailer_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["plot", "asd"], ["director", "asd"], ["genere", "asD"], ["trailer_url", ""], ["created_at", "2016-05-17 11:04:36.761042"], ["updated_at", "2016-05-17 11:04:36.761042"]]
---
  def create
  	@movie = Movie.new(movie_params)
    if @movie.poster_url != nil && @movie.poster_url != ""
      @movie.poster_from_url @movie.poster_url
    end
    @movie.trailer_url = sanitize_trailer_url(@movie.trailer_url)
  	if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" IN (1, 2, 3, 4, 5, 6, 7)
SELECT "movies".* FROM "movies" INNER JOIN "actors" ON "actors"."movie_id" = "movies"."id" WHERE "movies"."id" = ? AND "actors"."movie_id" = 1  [["id", 1]]
---
  def api_index_movie_actors
    @movie = Movie.find(params[:id])
    @actors = Actor.includes(:movies).where(movie_id: @movie.id)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 8]]
---
  def find_movie
  	@movie = Movie.find(params[:id])