app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE ("reservation"."show.datetime" BETWEEN '2016-05-13 12:12:07.451225' AND '2017-05-13 12:12:07.451242')
---
  def index
    authenticate_user!
    @reservations = Reservation.all

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @reservation = Reservation.find(params[:id])