app/controllers/shows_controller.rb

	def index
  	@shows = Show.all.order("datetime ASC")
    @reservations = Reservation.all
---
SELECT "shows".* FROM "shows"  ORDER BY datetime ASC
SELECT "reservations".* FROM "reservations" WHERE "reservations"."show_id" = 1

  def show
  	@show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", 13]]

  def reserve
    authenticate_user!
    @seatsString = params[:seatsToReserve] || session[:seatsToReserve]
    @show = Show.find(params[:id])
      if @seatsString && @seatsString != "" && @seatsString.length % 3 == 0
      	alreadyReserved = false
        if DateTime.now > @show.datetime - 30.minutes && !current_user.admin
          redirect_to @show.movie, alert: "È possible prenotare i biglietti solo fino a 30 minuti prima dell’inizio di ogni spettacolo."
        elsif DateTime.now > @show.datetime + 20.minutes
          redirect_to @show.movie, alert: "Non è più possibile prenotare i biglietti di questo spettacolo."
        else
         	reservation = Reservation.new(user: current_user, show: @show)
         	(0..((@seatsString.length - 3) / 3)).each do |i|
          	seatString = @seatsString.slice(3 * i, 3 * (i + 1))
          	row = seatString.slice(0, 1)
            p row
          	number = seatString.slice(1, 2)
            p number
          	seat = @show.theater.seats.where(row: row).where(number: number).take
          	if seat.reservations.where(show: show).exists?
          		alreadyReserved = true
          	end
          	reservation.seats << [seat]
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "seats".* FROM "seats" WHERE "seats"."theater_id" = ? AND "seats"."row" = ? AND "seats"."number" = ? LIMIT 1  [["theater_id", 1], ["row", "A"], ["number", 1]]
SELECT  1 AS one FROM "reservations" INNER JOIN "reservations_seats" ON "reservations"."id" = "reservations_seats"."reservation_id" WHERE "reservations_seats"."seat_id" = ? AND "reservations"."show_id" = 13 LIMIT 1  [["seat_id", 1]]
INSERT INTO "reservations" ("user_id", "show_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["show_id", 13], ["created_at", "2016-05-13 10:42:42.418200"], ["updated_at", "2016-05-13 10:42:42.418200"]]

  def api_reserve_seats
    @user = User.find_by_email(params[:email])
    if @user && @user.valid_password?(params[:password])
      @seatsString = params[:seats]
      @show = Show.find(params[:id])
      if @seatsString && @seatsString != "" && @seatsString.length % 3 == 0
        alreadyReserved = false
        if DateTime.now > @show.datetime - 30.minutes && !current_user.admin
          render json: "timelimit", status: :ok
        else
          reservation = Reservation.new(user: @user, show: @show)
          (0..((@seatsString.length - 3) / 3)).each do |i|
            seatString = @seatsString.slice(3 * i, 3 * (i + 1))
            row = seatString.slice(0, 1)
            p row
            number = seatString.slice(1, 2)
            p number
            seat = @show.theater.seats.where(row: row).where(number: number).take
            if seat.reservations.where(show: @show).exists?
              alreadyReserved = true
            end
            reservation.seats << [seat]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "ciccio"]]
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", 18]]
SELECT  "seats".* FROM "seats" WHERE "seats"."theater_id" = ? AND "seats"."row" = ? AND "seats"."number" = ? LIMIT 1  [["theater_id", 2], ["row", "a"], ["number", 1]]
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "reservations" INNER JOIN "reservations_seats" ON "reservations"."id" = "reservations_seats"."reservation_id" WHERE "reservations_seats"."seat_id" = ? AND "reservations"."show_id" = 25 LIMIT 1  [["seat_id", 309]]
SELECT "shows".* FROM "shows" WHERE ("shows"."datetime" BETWEEN '2016-05-14 00:00:00.000000' AND '2016-05-20 23:59:59.000000')  ORDER BY datetime ASC
INSERT INTO "reservations" ("user_id", "show_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["show_id", 25], ["created_at", "2016-05-16 23:31:09.406234"], ["updated_at", "2016-05-16 23:31:09.406234"]]