app/controllers/theaters_controller.rb

  def api_index
    @theaters = Theaters.all
---
SELECT "theaters".* FROM "theaters"