app/views/shows/index.html.erb

				<%= link_to "Spettacoli", shows_path, class: "nav_item selected" %>
			<% elsif current_user.reservations.count > 0 %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."show_id" = 54