app/views/shows/show.html.erb

				<%= link_to "Spettacoli", shows_path, class: "nav_item" %>
			<% elsif current_user.reservations.count > 0 %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 2]]

				<% end %>
				<div class="seat <%= row %><%= seat.number %><% unless seat.reservations.where(show: @show).empty? %> occupied<% end %>" onclick="select('<%= row %>', <%= seat.number %>)"><%= seat.number %></div>
---
SELECT COUNT(*) FROM "reservations" INNER JOIN "reservations_seats" ON "reservations"."id" = "reservations_seats"."reservation_id" WHERE "reservations_seats"."seat_id" = ? AND "reservations"."show_id" = 13  [["seat_id", 259]]